// დავალება 1 

// let weekday = prompt("შეიყვანე კვირის დღე")
// if(weekday == "ორშაბათი"){
//     console.log("შემოყვანილია სამუშაო დღე")
// }
// else if(weekday == "სამშაბათი"){
//     console.log("შემოყვანილია სამუშაო დღე")
// }
// else if(weekday == "ოთხშაბათი"){
//     console.log("შემოყვანილია სამუშაო დღე")
// }
// else if(weekday == "ხუთშაბათი"){
//     console.log("შემოყვანილია სამუშაო დღე")
// }
// else if(weekday == "პარასკევი"){
//     console.log("შემოყვანილია სამუშაო დღე")
// }
// else if(weekday == "შაბათი"){
//     console.log("შემოყვანილია დასვენების დღე")
// }
// else if(weekday == "კვირა"){
//     console.log("შემოყვანილია დასვენების დღე")
// }
// else{
//     console.log("შეცდომა")
// }

// დავალება 2

// let age = prompt("თქვენი ასაკი?")
// if (age >= 18){
//     alert ("თქვენ შეგიძლიათ საიტით სარგებლობა")
// }
// else{
//     alert("თქვენ არ ხართ სრულწლოვანი")
// }

// დავალება 3

  let text;
  if (confirm("ხართ თუ არა სრულწლოვანი?") == true) {
    console.log("თქვენ შეგიძლიათ საიტით სარგებლობა");
  } 
  else{
    console.log("არ შეგიძლია საიტით სარგებლობა, რადგან არ ხარ სრულწლოვანი");
  }